In [25]:
import pandas as pd
import os

In [30]:
import sqlite3 as sql

In [31]:
con = sql.connect(os.path.join('data','sql','nyc.sqlite'))

In [33]:
nyc_weather.to_sql('nyc_weather', con, if_exists='replace')

In [37]:
stations = pd.read_sql_query('SELECT station, latitude, longitude FROM nyc_weather group by station order by station', con)

In [38]:
nyc.to_sql('nyc', con, if_exists='replace')

In [71]:
pd.read_sql_query("select substr(pickup_datetime, 0, 11) AS day, sum(passenger_count), sum(trip_duration) from nyc group by day order by day DESC limit 2", con)

          day  sum(passenger_count)  sum(trip_duration)
0  2016-06-30                 12389             8181419
1  2016-06-29                 12484             7551892

In [59]:
nyc_weather.head(1)

,STATION,NAME,LATITUDE,LONGITUDE,ELEVATION,DATE,AWND,AWND_ATTRIBUTES,DAPR,DAPR_ATTRIBUTES,...,WT05,WT05_ATTRIBUTES,WT06,WT06_ATTRIBUTES,WT08,WT08_ATTRIBUTES,WT09,WT09_ATTRIBUTES,WT11,WT11_ATTRIBUTES
0,US1NYWC0003,"WHITE PLAINS 3.1 NNW, NY US",41.0639,-73.7722,71.0,2016-01-01,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [68]:
stations.head(2)

       STATION   LATITUDE  LONGITUDE
0  US1CTFR0022  41.064100 -73.577000
1  US1CTFR0039  41.037788 -73.568176

In [67]:
import math
d = math.sqrt((41.0639 - 40.767937)**2 + (-73.7722 + 73.982155)**2)
d

0.362870775061866

In [69]:
d = math.sqrt((41.037788 - 40.767937)**2 + (-73.568176 + 73.982155)**2)
d

0.49416411711293595

In [8]:
import pandas as pd

# read DataFrame
data = pd.read_csv('nyc_travel_4.csv')

data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 364661 entries, 0 to 364660
Data columns (total 11 columns):
id                    364661 non-null object
vendor_id             364661 non-null int64
pickup_datetime       364661 non-null object
dropoff_datetime      364661 non-null object
passenger_count       364661 non-null int64
pickup_longitude      364661 non-null float64
pickup_latitude       364661 non-null float64
dropoff_longitude     364661 non-null float64
dropoff_latitude      364661 non-null float64
store_and_fwd_flag    364661 non-null object
trip_duration         364661 non-null int64
dtypes: float64(4), int64(3), object(4)
memory usage: 30.6+ MB

In [5]:
1458644/4

364661.0

In [6]:

# no of csv files with row size
k = 4
size = 364661

for i in range(k):
	df = data[size*i:size*(i+1)]
	df.to_csv(f'nyc_travel_{i+1}.csv', index=False)